leetcode_1606_find_servers_that_handled_most_number_of_requests.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Leetcode: 1606. Find Servers That Handled Most Number of Requests</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="style.css">

</head>
<body>
<!--  --><nav><span class="nav-header">Problem Solving</span><span class="nav-items"><a href="index.html">Home</a><span></nav><div id="content" class="content">
<h1 class="title">Leetcode: 1606. Find Servers That Handled Most Number of Requests</h1>
<p>
<a href="https://leetcode.com/problems/find-servers-that-handled-most-number-of-requests/">Problem Statement</a>
</p>

<p>
This is a simulation problem where the goal is to pick the right data structures.  Time complexity is \(O(n \log m)\) with space \(O(n)\).
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">from</span> typing <span style="font-weight: bold;">import</span> List
<span style="font-weight: bold;">from</span> sortedcontainers <span style="font-weight: bold;">import</span> SortedList
<span style="font-weight: bold;">from</span> heapq <span style="font-weight: bold;">import</span> heappush, heappop


<span style="font-weight: bold;">from</span> sortedcontainers <span style="font-weight: bold;">import</span> SortedList


<span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">Solution</span>:
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">busiestServers</span>(<span style="font-weight: bold;">self</span>, k: <span style="font-weight: bold;">int</span>, arrival: List[<span style="font-weight: bold;">int</span>], load: List[<span style="font-weight: bold;">int</span>]) -&gt; <span style="font-weight: bold; font-style: italic;">List</span>[<span style="font-weight: bold;">int</span>]:
        available = SortedList(<span style="font-weight: bold;">range</span>(k))
        <span style="font-weight: bold; font-style: italic;">cleanup</span> = []
        <span style="font-weight: bold; font-style: italic;">counter</span> = {}

        <span style="font-weight: bold; font-style: italic;">busiest_count</span> = 0

        <span style="font-weight: bold;">for</span> i, start, time <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">zip</span>(<span style="font-weight: bold;">range</span>(<span style="font-weight: bold;">len</span>(arrival)), arrival, load):
            <span style="font-weight: bold;">while</span> cleanup <span style="font-weight: bold;">and</span> cleanup[0][0] &lt; <span style="font-weight: bold; font-style: italic;">start</span>:
                <span style="font-weight: bold; font-style: italic;">_</span>, <span style="font-weight: bold; font-style: italic;">server</span> = heappop(cleanup)
                available.add(server)

            <span style="font-weight: bold;">if</span> <span style="font-weight: bold; font-style: italic;">available</span>:
                j = available.bisect_left(i % k)
                <span style="font-weight: bold; font-style: italic;">server</span> = available[j <span style="font-weight: bold;">if</span> j &lt; <span style="font-weight: bold;">len</span>(available) <span style="font-weight: bold;">else</span> 0]
                available.remove(server)
                heappush(cleanup, (start + time - 1, server))
                counter.setdefault(server, 0)
                <span style="font-weight: bold; font-style: italic;">counter</span>[<span style="font-weight: bold; font-style: italic;">server</span>] += 1
                <span style="font-weight: bold; font-style: italic;">busiest_count</span> = <span style="font-weight: bold;">max</span>(busiest_count, counter[server])

        <span style="font-weight: bold;">return</span> [server <span style="font-weight: bold;">for</span> server <span style="font-weight: bold;">in</span> counter <span style="font-weight: bold;">if</span> counter[server] == busiest_count]


<span style="font-weight: bold;">assert</span> Solution().busiestServers(3, [1, 2, 3, 4, 5], [5, 2, 3, 3, 3]) == [1]
<span style="font-weight: bold;">assert</span> Solution().busiestServers(3, [1, 2, 3, 4], [1, 2, 1, 2]) == [0]
<span style="font-weight: bold;">assert</span> Solution().busiestServers(3, [1, 2, 3], [10, 12, 11]) == [0, 1, 2]
</pre>
</div>
</div>
</body>
</html>